CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_Digital
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_Digital(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t SWITCH_0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA9 (pin 61)  */
    GPIO_PinInit(RTEPIN_DIGITAL_SWITCH_0_GPIO, RTEPIN_DIGITAL_SWITCH_0_PIN, &SWITCH_0_config);

    gpio_pin_config_t SWITCH_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA11 (pin 63)  */
    GPIO_PinInit(RTEPIN_DIGITAL_SWITCH_1_GPIO, RTEPIN_DIGITAL_SWITCH_1_PIN, &SWITCH_1_config);

    gpio_pin_config_t SWITCH_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA13 (pin 65)  */
    GPIO_PinInit(RTEPIN_DIGITAL_SWITCH_2_GPIO, RTEPIN_DIGITAL_SWITCH_2_PIN, &SWITCH_2_config);

    gpio_pin_config_t SWITCH_3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA15 (pin 67)  */
    GPIO_PinInit(RTEPIN_DIGITAL_SWITCH_3_GPIO, RTEPIN_DIGITAL_SWITCH_3_PIN, &SWITCH_3_config);

    gpio_pin_config_t CAM_VSNC_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 111)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_VSNC_GPIO, RTEPIN_DIGITAL_CAM_VSNC_PIN, &CAM_VSNC_config);

    gpio_pin_config_t CAM_D_0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 113)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_0_GPIO, RTEPIN_DIGITAL_CAM_D_0_PIN, &CAM_D_0_config);

    gpio_pin_config_t CAM_D_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 114)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_1_GPIO, RTEPIN_DIGITAL_CAM_D_1_PIN, &CAM_D_1_config);

    gpio_pin_config_t CAM_D_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin 115)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_2_GPIO, RTEPIN_DIGITAL_CAM_D_2_PIN, &CAM_D_2_config);

    gpio_pin_config_t CAM_D_3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC11 (pin 116)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_3_GPIO, RTEPIN_DIGITAL_CAM_D_3_PIN, &CAM_D_3_config);

    gpio_pin_config_t CAM_D_4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 117)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_4_GPIO, RTEPIN_DIGITAL_CAM_D_4_PIN, &CAM_D_4_config);

    gpio_pin_config_t CAM_D_5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC13 (pin 118)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_5_GPIO, RTEPIN_DIGITAL_CAM_D_5_PIN, &CAM_D_5_config);

    gpio_pin_config_t CAM_D_6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC14 (pin 119)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_6_GPIO, RTEPIN_DIGITAL_CAM_D_6_PIN, &CAM_D_6_config);

    gpio_pin_config_t CAM_D_7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 120)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_D_7_GPIO, RTEPIN_DIGITAL_CAM_D_7_PIN, &CAM_D_7_config);

    gpio_pin_config_t CAM_PCLK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC18 (pin 125)  */
    GPIO_PinInit(RTEPIN_DIGITAL_CAM_PCLK_GPIO, RTEPIN_DIGITAL_CAM_PCLK_PIN, &CAM_PCLK_config);

    gpio_pin_config_t BEEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC19 (pin 126)  */
    GPIO_PinInit(RTEPIN_DIGITAL_BEEP_GPIO, RTEPIN_DIGITAL_BEEP_PIN, &BEEP_config);

    gpio_pin_config_t OLED_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 143)  */
    GPIO_PinInit(RTEPIN_DIGITAL_OLED_RST_GPIO, RTEPIN_DIGITAL_OLED_RST_PIN, &OLED_RST_config);

    gpio_pin_config_t OLED_D_C_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 144)  */
    GPIO_PinInit(RTEPIN_DIGITAL_OLED_D_C_GPIO, RTEPIN_DIGITAL_OLED_D_C_PIN, &OLED_D_C_config);

    gpio_pin_config_t SD_DTK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE6 (pin 9)  */
    GPIO_PinInit(RTEPIN_DIGITAL_SD_DTK_GPIO, RTEPIN_DIGITAL_SD_DTK_PIN, &SD_DTK_config);

    gpio_pin_config_t BUTTON_DN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE7 (pin 10)  */
    GPIO_PinInit(RTEPIN_DIGITAL_BUTTON_DN_GPIO, RTEPIN_DIGITAL_BUTTON_DN_PIN, &BUTTON_DN_config);

    gpio_pin_config_t BUTTON_RT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE8 (pin 11)  */
    GPIO_PinInit(RTEPIN_DIGITAL_BUTTON_RT_GPIO, RTEPIN_DIGITAL_BUTTON_RT_PIN, &BUTTON_RT_config);

    gpio_pin_config_t BUTTON_LF_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE9 (pin 12)  */
    GPIO_PinInit(RTEPIN_DIGITAL_BUTTON_LF_GPIO, RTEPIN_DIGITAL_BUTTON_LF_PIN, &BUTTON_LF_config);

    gpio_pin_config_t BUTTON_OK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE10 (pin 13)  */
    GPIO_PinInit(RTEPIN_DIGITAL_BUTTON_OK_GPIO, RTEPIN_DIGITAL_BUTTON_OK_PIN, &BUTTON_OK_config);

