CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
    /* PORTC18 (pin 125) is configured as PTC18 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_PCLK_PORT, RTEPIN_DIGITAL_CAM_PCLK_PIN, kPORT_MuxAsGpio);

    /* PORTC19 (pin 126) is configured as PTC19 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BEEP_PORT, RTEPIN_DIGITAL_BEEP_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[19] = ((PORTC->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC2 (pin 105) is configured as FTM0_CH1 */
    PORT_SetPinMux(RTEPIN_DIGITAL_MOTOR_RB_PORT, RTEPIN_DIGITAL_MOTOR_RB_PIN, kPORT_MuxAlt4);

    /* PORTC3 (pin 106) is configured as FTM0_CH2 */
    PORT_SetPinMux(RTEPIN_DIGITAL_MOTOR_LA_PORT, RTEPIN_DIGITAL_MOTOR_LA_PIN, kPORT_MuxAlt4);

    /* PORTC4 (pin 109) is configured as FTM0_CH3 */
    PORT_SetPinMux(RTEPIN_DIGITAL_MOTOR_LB_PORT, RTEPIN_DIGITAL_MOTOR_LB_PIN, kPORT_MuxAlt4);

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_VSNC_PORT, RTEPIN_DIGITAL_CAM_VSNC_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC6 (pin 111): Interrupt/DMA request is disabled */
    PORT_SetPinInterruptConfig(RTEPIN_DIGITAL_CAM_VSNC_PORT, RTEPIN_DIGITAL_CAM_VSNC_PIN, kPORT_InterruptOrDMADisabled);

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_0_PORT, RTEPIN_DIGITAL_CAM_D_0_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 114) is configured as PTC9 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_1_PORT, RTEPIN_DIGITAL_CAM_D_1_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin 141) is configured as SPI2_SCK */
    PORT_SetPinMux(RTEPIN_DIGITAL_OLED_SCK_PORT, RTEPIN_DIGITAL_OLED_SCK_PIN, kPORT_MuxAlt2);

    /* PORTD13 (pin 142) is configured as SPI2_SOUT */
    PORT_SetPinMux(RTEPIN_DIGITAL_OLED_SOT_PORT, RTEPIN_DIGITAL_OLED_SOT_PIN, kPORT_MuxAlt2);

    /* PORTD14 (pin 143) is configured as PTD14 */
    PORT_SetPinMux(RTEPIN_DIGITAL_OLED_RST_PORT, RTEPIN_DIGITAL_OLED_RST_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin 144) is configured as PTD15 */
    PORT_SetPinMux(RTEPIN_DIGITAL_OLED_D_C_PORT, RTEPIN_DIGITAL_OLED_D_C_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 137) is configured as I2C0_SCL */
    PORT_SetPinMux(RTEPIN_DIGITAL_IMU_SCL_PORT, RTEPIN_DIGITAL_IMU_SCL_PIN, kPORT_MuxAlt2);

    /* PORTD9 (pin 138) is configured as I2C0_SDA */
    PORT_SetPinMux(RTEPIN_DIGITAL_IMU_SDA_PORT, RTEPIN_DIGITAL_IMU_SDA_PIN, kPORT_MuxAlt2);

    /* PORTE0 (pin 1) is configured as SDHC0_D1 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_D_1_PORT, RTEPIN_DIGITAL_SD_D_1_PIN, kPORT_MuxAlt4);

    PORTE->PCR[0] = ((PORTE->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTE1 (pin 2) is configured as SDHC0_D0 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_D_0_PORT, RTEPIN_DIGITAL_SD_D_0_PIN, kPORT_MuxAlt4);

    PORTE->PCR[1] = ((PORTE->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTE10 (pin 13) is configured as PTE10 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BUTTON_OK_PORT, RTEPIN_DIGITAL_BUTTON_OK_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[10] = ((PORTE->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTE11 (pin 14) is configured as PTE11 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BUTTON_UP_PORT, RTEPIN_DIGITAL_BUTTON_UP_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[11] = ((PORTE->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp)

                      /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTE12 (pin 15) is configured as FTM3_CH7 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SERVO_0_PORT, RTEPIN_DIGITAL_SERVO_0_PIN, kPORT_MuxAlt6);

    /* PORTE2 (pin 3) is configured as SDHC0_DCLK */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_CLK_PORT, RTEPIN_DIGITAL_SD_CLK_PIN, kPORT_MuxAlt4);

    PORTE->PCR[2] = ((PORTE->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTE3 (pin 4) is configured as SDHC0_CMD */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_CMD_PORT, RTEPIN_DIGITAL_SD_CMD_PIN, kPORT_MuxAlt4);

    PORTE->PCR[3] = ((PORTE->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

